In [3]:
import pandas as pd

In [4]:
data = [ ["John",89,92,69] , ["David", 90,92,88] , ["Chris",91,94,93] ]
df = pd.DataFrame(data)
df

       0   1   2   3
0   John  89  92  69
1  David  90  92  88
2  Chris  91  94  93

In [5]:
columns = ["Name" , "Math" , "Phy" , "Chem"]
df.columns = columns
df

    Name  Math  Phy  Chem
0   John    89   92    69
1  David    90   92    88
2  Chris    91   94    93

### OR

In [6]:
data_1 = {
    "Names":("John","David","Chris") , "Math":(89,90,91) , "Phy":(92,92,94) , "Chem":(69,88,93)
         }
df_1 = pd.DataFrame(data_1)
df_1

   Names  Math  Phy  Chem
0   John    89   92    69
1  David    90   92    88
2  Chris    91   94    93

In [7]:
# ------------------------------------------------------- #

In [8]:
df["Total"] = df.apply(lambda row : row["Math"] + row["Phy"] + row["Chem"] , axis=1)
df

    Name  Math  Phy  Chem  Total
0   John    89   92    69    250
1  David    90   92    88    270
2  Chris    91   94    93    278

In [9]:
#################################################################################

In [10]:
boxdata = [ [10,2,5] , [9,8,3] , [6,6,6] ]
box_columns = ["Length", "Height", "Width"]
boxes = pd.DataFrame(boxdata)
boxes.columns = box_columns
boxes

   Length  Height  Width
0      10       2      5
1       9       8      3
2       6       6      6

In [11]:
boxes["Volume"] = boxes.apply(lambda row : row["Length"] + row["Height"] + row["Width"] , axis=1)
boxes

   Length  Height  Width  Volume
0      10       2      5      17
1       9       8      3      20
2       6       6      6      18

In [12]:
# ------------------------------------------------------- #

#### CHALLENGE 1

In [37]:
# i) with array approach
rectdata = [ [40,10] , [20,9] , [3.4,4] ]
rect_columns = ["Height" , "Width"]
rect = pd.DataFrame(rectdata)
rect.columns = rect_columns
rect

   Height  Width
0    40.0     10
1    20.0      9
2     3.4      4

In [38]:
def area(row):
    return row["Height"]*row["Width"]
rect["Area"] = rect.apply(area , axis=1)
rect

   Height  Width   Area
0    40.0     10  400.0
1    20.0      9  180.0
2     3.4      4   13.6

In [39]:
# ii) with dict approach
rectdata = {
    "Height":(40 , 20 , 3.4) , "Width":(10 , 9 , 4)
         }
rect = pd.DataFrame(rectdata)
rect

   Height  Width
0    40.0     10
1    20.0      9
2     3.4      4

In [40]:
rect["Area"] = rect.apply(lambda row : row["Height"] + row["Width"] , axis=1)
rect

   Height  Width  Area
0    40.0     10  50.0
1    20.0      9  29.0
2     3.4      4   7.4

In [41]:
# ------------------------------------------------------- #

#### CHALLENGE 2

In [42]:
discdata = [ [1,-5,6] , [1,-7,12] , [1,-2,1] , [2,4,6] ]
disc_columns = ["a" , "b" , "c"]
disc = pd.DataFrame(discdata)
disc.columns = disc_columns
disc

   a  b   c
0  1 -5   6
1  1 -7  12
2  1 -2   1
3  2  4   6

In [43]:
def discriminant(row):
    a = row["a"]
    b = row["b"]**2
    c = row["c"]
    return (b - 4*a*c)
disc["Discriminant"] = disc.apply(discriminant , axis=1 )
#
def check_root(row):
    a,b,c = row["a"] , row["b"] , row["c"]
    disc = b**2 - 4*a*c
    if (disc > 0): return ("2 Real Roots")
    elif (disc == 0): return ("2 Equal Roots")
    else: return ("2 Imaginary Roots")
disc["Roots"] = disc.apply(check_root , axis=1 )
disc

   a  b   c  Discriminant              Roots
0  1 -5   6             1       2 Real Roots
1  1 -7  12             1       2 Real Roots
2  1 -2   1             0      2 Equal Roots
3  2  4   6           -32  2 Imaginary Roots

In [44]:
# ------------------------------------------------------- #

#### CHALLENGE 3

In [45]:
circledata = [2,5,7,10]
circle_columns = ["Radius"]
circle = pd.DataFrame(circledata)
circle.columns = circle_columns
circle

   Radius
0       2
1       5
2       7
3      10

In [46]:
circle["Area"] = circle.apply(lambda row : 3.14*row["Radius"]**2 , axis=1)
circle["Cirumference"] = circle.apply(lambda row : 6.28*row["Radius"] , axis=1)
circle

   Radius    Area  Cirumference
0       2   12.56         12.56
1       5   78.50         31.40
2       7  153.86         43.96
3      10  314.00         62.80

In [47]:
# ------------------------------------------------------- #

#### CHALLENGE 4

In [48]:
# i) Method 1
nosqdata = [ [1,2,3] , [10,12,15] , [3,6,9] ]
nosq_columns = ["a" , "b" , "c"]
nosq = pd.DataFrame(nosqdata)
nosq.columns = nosq_columns
nosq

    a   b   c
0   1   2   3
1  10  12  15
2   3   6   9

In [54]:
sqdata = [[]]
sq = pd.DataFrame(sqdata)
sq = nosq.apply(lambda row : row**2)
sq

     a    b    c
0    1    4    9
1  100  144  225
2    9   36   81

In [57]:
import numpy as np

In [59]:
# ii) Method 2
sqdata = [[]]
sq = pd.DataFrame(sqdata)
sq = nosq.apply(np.sqrt)
sq

          a         b         c
0  1.000000  1.414214  1.732051
1  3.162278  3.464102  3.872983
2  1.732051  2.449490  3.000000

In [60]:
# ------------------------------------------------------- #

In [81]:
# ------------------------------------------------------- #

In [ ]:
# ------------------------------------------------------- #

In [91]:
data = [ ["John",89,92,69] , ["David", 90,92,88] , ["Chris",91,94,93] ]
df = pd.DataFrame(data)
columns = ["Name" , "Math" , "Phy" , "Chem"]
df.columns = columns
df

    Name  Math  Phy  Chem
0   John    89   92    69
1  David    90   92    88
2  Chris    91   94    93

In [92]:
marks = df
marks.set_index("Name" , inplace = True)
marks

       Math  Phy  Chem
Name
John     89   92    69
David    90   92    88
Chris    91   94    93

In [93]:
marks["Total"] = df.apply(np.sum , axis=1)
marks["Mean"] = df.apply(np.mean, axis=1)
marks

       Math  Phy  Chem  Total   Mean
Name
John     89   92    69    250  125.0
David    90   92    88    270  135.0
Chris    91   94    93    278  139.0

In [94]:
# ------------------------------------------------------- #

In [95]:
# ------------------------------------------------------- #

In [96]:
# ------------------------------------------------------- #

In [97]:
sqdata = [ [1,2,3] , [10,12,15] , [3,6,9] ]
sq_columns = ["a" , "b" , "c"]
sq = pd.DataFrame(sqdata)
sq.columns = sq_columns
sq

    a   b   c
0   1   2   3
1  10  12  15
2   3   6   9

In [104]:
fin = sq.applymap(lambda x : round(x**2))
fin

     a    b    c
0    1    4    9
1  100  144  225
2    9   36   81